# Тесты
# [-0.008, -0.066, -0.209, -0.439, -0.734, -1.044, -1.31, -1.484, -1.542, -1.491, -1.366, -1.218, -1.093, -1.02, -0.998, -1, -0.982, -0.901, -0.733, -0.479, -0.174, 0.128, 0.372,0.513, 0.537, 0.46, 0.323, 0.177, 0.065, 0.009, -0.002] , [-3;3], 0.2
# [-5,-4.597,-4.178,-3.727,-3.234,-2.688,-2.082,-1.411,-0.674,0.131,1,1.929,2.91,3.935,4.99,6.063,7.134,8.187,9.198,10.145,11],[0;2],0.1
# [0, 1.483, 2.739, 3.782, 4.647, 5.437, 6.363, 7.723, 9.749, 12.314, 14.659, 15.538, 14.109, 11.222, 9.578, 11.331, 14.75, 15.096, 11.393, 9.66, 13.403],[0;4],0.2
# [-4.045, 1.782, 2.279, 2.398, 2.322, 2.109, 1.784, 1.355, 0.83, 0.281, 0, 0.281, 0.83,1.355, 1.784, 2.109, 2.322, 2.398, 2.279, 1.782, -4.045],[-3;3],0.3

clear all;
disp('Введите массив значений у');
vector = input('');
disp('Введите интервал');
interval = input('');
disp('Введите шаг');
step = input('');

#Создаем список значений Х
a = interval(1);
b = interval(2);
List = a : step : b;
#матрица значений Y и deltaY
matrix(:, 1) = vector;
e = 3; 
k = min(length(vector), e); #количество считаемых дельт
#записываем дельты в матрицу
for i = 2 : k
    for j = 1 : length(vector) - i + 1
        matrix(j, i) = matrix(j + 1, i - 1) - matrix(j, i - 1);
    endfor
endfor
#создаем массив y'
for i = 1 : length(vector) - k
    Result = 0;
    Sign = 1;
    for j = 2 : k
        Result += (matrix(i, j) * Sign) / (j - 1);
        Sign *= -1;
    endfor
    Arr(i) = Result / step;
endfor
#отрисовка графика
plot(List, vector, "b", List(1 : length(List) - k), Arr, "r");

